# Description:
#   Example scripts for you to examine and try out.
#
# Notes:
#   They are commented out by default, because most of them are pretty silly and
#   wouldn't be useful and amusing enough for day to day huboting.
#   Uncomment the ones you want to try and experiment with.
#
#   These are from the scripting documentation: https://github.com/github/hubot/blob/master/docs/scripting.md

cronJob = require('cron').CronJob
random = require('hubot').Response::random

module.exports = (robot) ->

  morningCronJob = new cronJob('0 0 10 * * 1-5', () =>
    envelope = room: "#01_general"
    robot.send envelope, "
　　　　　　　　　　「;:丶、:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:|\r\n
　　　　　 　 　 　 ﾄ､;:;:;:丶､:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:|\r\n
　　　　　　　　　　{::ﾄ､:;:;:;:;:;:｀ '' ー―――;:;: '|\r\n
　　　　　　　　 　 l::l . 丶､:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:|\r\n
　　　　　　　 　 　',:i r- ､、` ' ―――一'' \" .|\r\n
　　　　　　　 　 　 || ヾ三) 　 　 　 ,ィ三ﾐｦ　 |　\r\n
　　　　　　　 　 　 lj　　　　　　　　 ﾞ' ― '′ .|\r\n
　　　　　　　　　　 | , --:.:、:..　　 .:.:.:.:..:.:...　　|　良い朝でおじゃる\r\n
　　　　　　　　　　 | fr‐t-､ヽ.　 .:.:. '\",二ニ､､|\r\n
　　　　　　　　　　 l 丶‐三' ﾉ　　 :ヾイ､弋::ノ|　\r\n
　　　　　　　　　　 ',　ﾞ'ｰ-‐' ｲ: 　 :..丶三-‐'\"|\r\n
　　　　　　　　　 　 ',　　　　/.:　　 .　 　　　　|\r\n
　　　　　　　　　　　 ',　　,ｨ/ :　　　.:'^ヽ、.. 　|\r\n
　　　　　　　　　　 　 ',.:/.:.,{、:　　 .:　,ノ 丶::. |\r\n
　　　　　　　　　　　　ヽ　.i:, ヽ､__, イ　 　 _｀ﾞ.|\r\n
　　　　　　　　　 　 　 ,.ゝ､ト=､ェｪｪェ=テアヽ|\r\n
　　　　　　　　　　　_r/ /:.｀i ヽヾェェシ／ 　 |\r\n
　　　　 _,,. -‐ '' \" ´l. { ｛:.:.:.:',　`.':==:'.\"　　　 |\r\n
一 '' \"´　　　　 　　 ',ヽ丶:.:.:ヽ、　⌒ 　 　　 ,|\r\n
　　　　　　　　 　 　 ヽ丶丶､:.:.ゝ､ ＿＿_,. ｲ |\r\n
　　　　　　　　　 　 　 ｀丶､ ｀`\"二ﾕ、_,.＿___|\r\n
"
  )
  morningCronJob.start()

  lunchCronJob = new cronJob('0 30 12 * * 1-5', () =>
    envelope = room: "#01_general"
    greeting = "【お昼の時間です。】" + random ["\r\n
　　　　　　　　　　　　　　　　　　　./:;:;:;::;;::;　:;:;:;:/\r\n
　　　　　　　　　　　　　　　　　　 /´`ｰ─:;:;:;:;:;:/\r\n
　　　　　　　　　　　　　　　　　　/｀ﾝｰ-､:;;:;:;::;:|　　　　ﾄ､　　　　　　,ｲ|\r\n
　　　　　　　　　　　　　　　　　,ｲ/　　q　q`ヾh　　　　| LY´￣￣｀7/ !\r\n
　　　 　 　 　 　 　 　 　 　 　,jｲﾘ' rｪzjゞ _,,,,jｶ}　　　　| |　｀`ー‐'\"´;　|　　麻呂のスタンド『メシクレー』は\r\n
　　　　　　　　　　　　　　　　ﾘ^jﾞ', 　\"´V'''''~jﾐi!　　　　l |　　　 　 　 ', |　　スデに『昼飯』を『要求』している…\r\n
　　　　　　　　　　　　　　　　ﾄﾚ' ,'　　‐-､,, /ｿ'　　 　　V　　　　　　 _} !\r\n
　　　　　　　　　　　　　　　　ヾﾄ､　　 ｀`　,ﾞ/　　　　 　 {「::i!;ヽ　,ｨ;;i!:7 |\r\n
　　　　　　　　　　　　　　　　/j　 ヾ:;;;;;;:.:,ｲ´ 　 　　　 　l ゞ=''ﾞ;　;ゞ='',' |\r\n
　　　　　　　　　　　　　　 , ｲ〈 　 　.:;;;;;:.:/　　　　　＿ _」 ',　　　　　,'　i!\r\n
　　　　　　　　　　 　 　,イ 　ヽ ｰ-─／´ﾄ､　　,r'´子タ　ﾄ､　‐=-　／:.!L,．-──- ､\r\n
　　　　　　　　_,．-‐''´ ＼ヽｰ -- 、＿／　｀ヽ/｡ ｡ ｡　　_」;;:ヽ __,ィ　,r'´　 ,r''\"´￣｀ﾌ＼\r\n
　　　 ,r─''\"´　　　　 　　｀──∥∥─''´ゝﾉ 　 ,rｭ_」7,ｲj!;:;:;:;:;::.:.:,ﾉ, イ7′　　, '´/7rｪヽ\r\n
　　 / i;;;;;;;| 　　　　　　　　　　　　　　／￣,/q　/ﾊ ﾚ'ヾヾ＼;;:;:.:.:: .: . ./´ｰ＝=ｲ､,　弋夲/i\r\n
　　 !　|;;;;;;|　　　　　　　　　　 　　　/　　,イl　　 L_」l　 ﾚ'´　　　　　_ノ二ﾆヽ　 ヾヽ　　｀¨7\r\n
　　 |　ﾞi;;;;;|　　　　 　　　　　　　　　ﾊ__ノ^|」 ｏ　ｏ oﾄ､/　　,．-‐'\"´＼　　_」」＿」_」､　　/\r\n
　　 ,〉､ ﾞi;;;;､　　　　　　　　　　　ノ-､/, イ:;￣￣｀¨`Y;:,r'\"´二ﾆヽ,．-‐''\"´｀ヽ　　 ヽi|　/\r\n
　　,ﾊ　＼ﾄ;;､　　　　　　　　　　/ｰ-/　 /　.:.:　　　 _,ﾘ´　　￣｀＼＼　　　ヽ　 ＼　 ,j!,ｲ\r\n
　 /　iヽ　　ﾊ　　　　　　　　;r'ｰ=,/　 /　　.:.:　 _／　　　　　 　 /　ﾞi＼　　 ｀, 　 !／.:;:;!\r\n
 ,/　　!　＼,! ﾄ､　　　　　 ,r'´　￣i　　i　　／￣　　　　　　　　 /　　|　 !　　　i　/　　 /\r\n
","
　　　　　　　　,ト--ミ､、_:::::::::::::::::｀:\"'':―┼――――l\r\n
　　　　　　　 /ミミ三三ﾐ'ー‐-- ､、＿:::::::|:::::::::::::::::::::::j\r\n
　　　　　　　 {ミミミ三三、　　 　 ､ｰ=､`'┴―――fミ',\r\n
　　　　　　,..､ﾐﾐミミミ三ｼ　　. . . . `―' l ii l　(ヲ　　lミil\r\n
　　　　　 //う{ﾐﾐミミf'\"　　　_,,.,,_:.:.:.:..　 _j_　.:.:.:.　　lﾐﾘ\r\n
　　　　　 l V　}ﾐﾐミミ　　　 ',ｨでiﾝﾐ、:.:.､__, -,ｨも=､',l:l′　　　　いただきますでおじゃる♪\r\n
　　　　　 'i l ,ﾉヾミミ'　　　 ´￣｀ﾞ`ラ .:. 三 f\"´￣｀' lj\r\n
-、 　　　 ヽヽへ}ミﾐ　　　　 ｀二ﾆノ ,、 jl　',` ―''\" ,l!\r\n
　　ヽ、　　 ヽ二ﾉミ'　　/ / / / ,ィ'\" 　 　 ﾄ、/ / /.,!\r\n
、　　 ヽ　 , f-､､!'ミ　　　 　 　 ／ `^ヽ,＿ノi　　　 ,'\r\n
　ヽ、　 ヾ　　　/i,ﾐ'　　 　 \" ／　　 　　　、l　　　 /\r\n
　　 ヽ　,‐ヽ__,ノ lN 　　 :: ／ ｲｴｴｪｪｪｪｴｲ, ,}　::,/\r\n
、　　 ヾヽ__） ヽ ', ヽ　 　 { \" |⌒'ｰ'‐'‐'‐',ﾘ l　 /\r\n
　ヽ、 ,.-ヾ, ＼ ヽ'、 ヽ 　 l 　{,ゝ､‐r‐'ﾝ-i/ ,/ ,ｲ丶､、\r\n
_　 　>､ _ﾉ､＼＼ヽヽ丶　丶 ヾ　Zェｪｪｼ'　ﾉ ,i'lヽ、　｀ヾー-- ､\r\n
(｀'''ヽ'---'､＼＼＼.ヽ 丶、 ｀ ｀ ‐ -- ‐'\"/ノ ,l　 ＼＿＿_ 　　ヽ\r\n
￣¨　　　　 　 ＼＼＼＼　　　　　　　　　　　　　 ノ　　　　｀ヽ　　　\r\n
　　　　　　　　　 ＼> .＼＼　　　　　　　　　　　（く￣ ヽ　　,　 |　　\r\n
　　　　　　　　　　　　　　＼>　　　　　 (^ヾ｀'ｰ-ヽ､_￣ _ノ,--　ヽ\r\n
　　　　　　　　　　　　　　　　　　 (￣｀ヽ ヽ､\r\n
"]
    robot.send envelope, greeting
  )
  lunchCronJob.start()

  goHomeCronJob = new cronJob('0 0 18 * * 1-5', () =>
    envelope = room: "#01_general"
    greeting = "【まもなく定時になります。】" + random ["\r\n
　　　l:;_;:_:;:_:;:_::_:;:_:;:_:;:_:;:_::_:;::_;|\r\n
　　　l:;_;:_:;:_:;:_::_:;:_:;:_:;::;:_;:;:_:;:_;|\r\n
　　　|＿＿＿＿＿＿＿＿＿|\r\n
　　　/　　　 ｌ　/　　　 ＼＼ヽ|）\r\n
　　　| 　　　|　''''''''''　　 　''''''''|\r\n
　　　| 　　　| ( 　･ )　　　( ･ )l\r\n
　　　| 　 　 ｌ　 　　　　　 ｌ　　|　　　　\r\n
　　　| 　（ ~　 　　 　　　 _)　 |　　　　そろそろ定時ですね。\r\n
　　　 | 　 |　 　 　 ,―――.　ｌ 　　　　明日もう一度このチャンネルに来てください。\r\n
　　　　ｌ　.|ヽ　 　　ー――' / 　　　　　本当の「麻呂」をご馳走しますよ。\r\n
　　　　ヾ |　 ＼＿＿＿＿ノ 　　　\r\n
　 ＿＿／ヽ＼　　　　　　| ｌ＼＿\r\n
￣　　　　　λ ヽ　　　　 / .|\r\n
","\r\n
|:;:;:;:;:;:;:;:;:;:;:;:;:;:i;:;:;:;:;:;:;:;:;:;:;:;:;\r\n
|;:;:_:;:_:;:_:;:_;:;_:;:l:;_;:_:;:_:;:_:;:_;:_;\r\n
|＿＿＿＿＿_|＿＿＿＿＿\r\n
／ 　\" ,,　\"　 \"　　ﾞ　 ﾞ　 /\r\n
,イ \"　\"　　\"　 八 ﾞ　ｉ ﾞ　| 　 ： 定\r\n
/　,ｨ´ \"/' ｲ　/::: ヽ　ﾄ、ﾞ|　　： 時\r\n
／/ ｨ' /| /| /:::　, -ヾ､ヽ,| 　 ： だ\r\n
　l　 l /-ﾚ､ﾚ'　 ´_,　a=＝|　！　 \r\n
　! /l,ﾊ＝a=､ 　ヾ`ー　 ´|　　 　 \r\n
　'\"　　',`ー/ :::　　　　　　|　　 　\r\n
　　　　 ',　/ ;:::: ､　　　 　　ヽ＿　　＿__\r\n
　　　 　 ∨_,　- '　　_,　　::::/;;;;::ﾉノ ヾ\r\n
　　　　　 丶 ｰ '' \"´　　 .:::/;;;;;::´　　 `\r\n
　　ｒ―､,／丶　 =＝　 .:::/;;;;;::::::\r\n
`<´ヽ r‐ヾ-､ ＼ 　　:::／;;;;::::::　　　　/\r\n
.(´ヽ　ゝー)ｒ┤/＼:／::;;;;::::::　　　　/\r\n
"]
    robot.send envelope, greeting
  )
  goHomeCronJob.start()
