# Description:
#   Example scripts for you to examine and try out.
#
# Notes:
#   They are commented out by default, because most of them are pretty silly and
#   wouldn't be useful and amusing enough for day to day huboting.
#   Uncomment the ones you want to try and experiment with.
#
#   These are from the scripting documentation: https://github.com/github/hubot/blob/master/docs/scripting.md

module.exports = (robot) ->

  robot.hear /麻呂/i, (msg) ->
    msg.send msg.random [
      "なんじゃ？",
      "麻呂を呼んだかえ？",
      "騒がしいのぅ。何用じゃ？",
      "ん？",
      "麻呂を呼んだからには、それなりの要件であろうな？",
      "お公家の名を軽々しく呼ぶでない！"
      ]

  robot.hear /金原/i, (msg) ->
    msg.send msg.random [
      "金原殿。下郎がお呼びじゃぞ",
      "GLの名を軽々しく口にするでないわ！",
      "その前に麻呂が話を聞いてやろう。申してみよ。",
      "金原氏と話したいとな？まずは麻呂に蹴鞠で勝ってからにせよ。"
      ]

  robot.hear /浅井/i, (msg) ->
    msg.send msg.random [
      "浅井殿は今ぷよぷよの事で頭が一杯なのじゃ。後にせい",
      "多忙な浅井殿は仕事が絶賛ボンバーマン中じゃ。",
      "その人、さっきネズミーランドで見たよ。",
      "熊の釜山を知っておるか？麻呂はまだ見た事がないのじゃ"
      ]

  robot.hear /見つけ/i, (msg) ->
    msg.send "
　　　　　　　　　　　　　　　　　　　　　　　　　　　　　 　/;:;:;:;:;:;:/:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:l\r\n
　　　　　　　　　　　　　　　　　　　　　　　　　 　 　 　 /;:;:;:;:;:;:/:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:l\r\n
　　　　　　　　　　　　　　　　　　　　　　　　　　　　　/､;:;:;:;:;:/:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:l\r\n
　　　　　　　　　　　　　　　　　　　　　　　　　　　 ,ｨ{;:;:＼;:;:/;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;l\r\n
　　　　　　　　　　　　　　　　　　　　　　　　　　　.i;/＼;:;:;X､＿＿＿＿＿＿＿__j\r\n
　　　　　,....､　　　　＿＿__　　　　　　　　　 　 　 ﾘ (ﾐ､ヾL;:__;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:l\r\n
　　　　 / 　 ヽ..._／二二二ト､ r‐ュ　　　 　　　 /_,, ｀´ .:　r=｀､` '' ‐r―--＝=〈\r\n
　 　 ／　ｒ┴┴‐┼──‐弋三三マヽ　　　　 / ﾄｭﾐy　　 ｀~´　　,ノ::::::::::::::::::::ﾉ\r\n
　　j　 ￣＞──┴─　､:.:.:.|─‐９|<7|l　 　　,'　｀`ラ, ,ｨｴ二丶、^ヾﾐ:::::::::::::ｨﾍ\r\n
　 f'　 ７´ ´¨｀ヽ｀ヽヽ:::::::__ヽ|}}─ j|^:|Yl 　 　 !　 ,.. /　.: 'ヾﾋi≧ｧﾐ　,}::::::::::ノｸﾉ\r\n
　j 　､l::;′　　　Y:::::l:::l::::{　ヾ!|!ｭ:.:.:l|:::V 　 　 ﾞl,/ (;'　,rぅ､、　　　　 ,':::::r'\"(.イ\r\n
　l　　l:::|　　　　 ||:::::|:::|::ﾊ　　＼_:.:.:ﾄ､::ﾄ＿_,,.ｨ'l ﾍ`ﾆ\"´　ヽ　　_,.　,':::ｸ>-ﾍ-ゝ､、\r\n
　l　 ｀ヽヽ ＿_ノ/.::/::/:::::/ヽ　　　￣ヽr‐'´　/l'! lﾄﾐ三=ァｨ` ,:\" , ,ﾙｲ /:.:.:.::/ ﾘ ｀`t､ー-\r\n
　 '　 ／ マ＝∠∠∠∠ -'\"　 　 　 　 ∨ 　 {i,ヽ丶-‐ '\"ノ ,/,／:::://:.:.:.:.:/ /　　　 ヽ:::\r\n
　　' 　 　 ﾊ::::｢ -r ､　　 　 　 　 　 　 　 ∨ 　ヾ.丶.,＿_,, -‐'\"　 ／ﾉ:.:._／／　　　　　}::\r\n
　　 }　　　ﾊ::::∨　 ヽ　　　　　　　　　　　ヽ、　 ゝﾐミ三ニ＝≦,,ムﾆ彡'\"　　　　　 ノ::\r\n
　　/　　　　ヽ:::ヽ　　ヽ　　　　　　　　　　　＼'\"::::::::::::::::l::::::::::::::::::::::丶､＿＿,,r ''\":::::::\r\n
"

#  robot.hear /maro$/i, (msg) ->
#    msg.send 'nanjya?'
